<?php

// Функция возвращает объект фотографии (ассоциативный массив)
function galleryItem($id) {
  // тип результата - array
}

// Функция возвращает список фотографий
function galleryList() {
  // тип результата - array
}

// Функция возвращает путь к уменьшенному изображению
function galleryIcon($photo) {
  // тип результата - string
}

// Функция возвращает путь к полноразмерному изображению
function galleryImage($photo) {
  // тип результата - string
}

// Функция добавляет в галерею новую фотографию.
function galleryAdd($file_path, $file_name) {
  // реализация пропущена
}

?>